#include "LataleVersionDef.h"

//namespace latale
//{
const unsigned short int VER_MAJOR  = 262;
const unsigned short int VER_MINOR  = 473;

//468,ÍòÊ¥½Ú°æ±¾08Äê

//460
//È¥µôÉÌ³Ç°ü¹üÀ¸À©³ä

//459¹úÇé°æ±¾

//457ÀñÎïÐÞ¸Ä

//456
//»Ö¸´ÄÚ´æÄ£¿é£¬ÐÞ¸Ä×ÖÌå´íÔÚÎÊÌâ

//453 
//ÐÞ¸Ä×ÖÌå gdi Ä£¿é£¬È¥µôÆµ·±¼ÓÔØÎÊÌâ

//439
//ÐÞÕýÀ®°ÈÉùÒôÎÊÌâ¡£Ôö¼Ó°ü¹üÀ¸±ã½ÝÏû·ÑÄ£¿é



//433
/*
µÚÒ»¸öºÏ²¢°æ±¾£¬¸ü¸ÄÎÆÀí£¬×ÖÌå£¬À®°ÈµÈ
*/
//


//½ÉÀÇ¹öÁ¯		210110	- 20050921
//½ÉÀÇ¹öÁ¯ÆÐÄ¡	210111	- 20050923
// 211112 - 2005/10/10 Å¬·ÎÁîº£Å¸ ¾ÈÁ¤È­½ÃÀÛ
// 212114 - 2005/10/11 Å¬·ÎÁîº£Å¸ ¾ÈÁ¤È­
// 213116 - 2005/10/14 Å¬·ÎÁîº£Å¸ ¾ÈÁ¤È­
// 214117 - 2005/10/17 Å¬·ÎÁîº£Å¸ ¾ÈÁ¤È­
// 214118 - 2005/10/17 Å¬·ÎÁîº£Å¸ ¾ÈÁ¤È­
// 214119 - 2005/10/17 Å¬·ÎÁîº£Å¸ ¾ÈÁ¤È­
// 214120 - 2005/10/17 Å¬·ÎÁîº£Å¸ ¾ÈÁ¤È­
// 214121 - 2005/10/18 Å¬·ÎÁîº£Å¸ ¾ÈÁ¤È­
// 214122 - 2005/10/19 Å¬·ÎÁîº£ÅÍ ¾ÈÁ¤È­ ( Æ÷Å»½Ã ¹ö±× ¼öÁ¤ )
// 215123 - 2005/10/20 Å¬·ÎÁîº£ÅÍ ¾ÈÁ¤È­ ( ¸ó½ºÅÍ ¸®Á¨ ¹ö±× ¼öÁ¤, ½ºÅ³»ç¿ë½Ã ´« Àß¸ø ·»´õµÇ´Â ¹ö±× ¼öÁ¤ )
// 215124 - 2005/10/20 Å¬·ÎÁîº£ÅÍ ¾ÈÁ¤È­ ( ½º¼¦ ·¹Á¹·ç¼Ç ¼öÁ¤)
// 215125 - 2005/10/20 Å¬·ÎÁîº£ÅÍ ¾ÈÁ¤È­ ( ÀÎº¥Åä¸®³ª´©´Â ¹ö±×¼öÁ¤ )
// 215126 - 2005/10/21 Å¬·ÎÁîº£ÅÍ ¾ÈÁ¤È­ ( Äü½½·Ô ¹ö±× ¼öÁ¤ ¹× ÀÌ¹ÌÁö ÇÁ¸® ·Îµù , ÀÎº¥Åä¸® °¹¼ö ÇÕÄ¡°í ³ª´©´Â ¹ö±× ¼öÁ¤ )

// 216127 - 2005/11/23 2Â÷ Å¬·ÎÁîº£Å¸ÁØºñ 1Â÷ÆÐÅ·
// 217128 - 2005/11/23 2Â÷ Å¬·ÎÁîº£Å¸ÁØºñ ¿òÁ÷ÀÓ ¹ö±×¼öÁ¤
// 217129 - 2005/11/23 2Â÷ Å¬·ÎÁîº£Å¸ÁØºñ ¸ó½ºÅÍ FX¹ö±×¼öÁ¤
// 218130 - 2005/11/24 2Â÷ Å¬·ÎÁîº£Å¸ÁØºñ ÀÎº¥¹ö±×¼öÁ¤- 64
// 218131 - 2005/11/24 2Â÷ Å¬·ÎÁîº£Å¸ ¹ÝÁö, »ç¿îµå ÀÔ·Â
// 218132 - 2005/11/24 2Â÷ Å¬·ÎÁîº£Å¸ UIµî Â¥ÀßÇÑ ¹ö±×¼öÁ¤

// 219133 - 2005/12/06 3Â÷ Å¬·ÎÁîº£ÅÍÁØºñ 1Â÷ÆÐÅ· AJJIYA
// 219134 - 2005/12/06 3Â÷ Å¬·ÎÁîº£ÅÍÁØºñ FX¹ö±×¼öÁ¤ 
// 219135 - 2005/12/06 3Â÷ Å¬·ÎÁîº£ÅÍÁØºñ µð½ºÄ¿³ØÆ® ¸Þ½ÃÁö Ãß°¡
// 219136 - 2005/12/07 3Â÷ Å¬·ÎÁîº£ÅÍÁØºñ ¼ÒÄÏµð½ºÄ¿³ØÆ®¹ö±×, ½ºÅ³ ·ÎÄÃÇÃ·¹ÀÌ¾î°¡ ³ÎÀÏ¶§ Á×´Â¹ö±× 
// 219137 - 2005/12/07 3Â÷ Å¬·ÎÁîº£ÅÍÁØºñ Æ÷Å»½Ã Á×´Â ¹ö±×
// 219138 - 2005/12/07 3Â÷ Å¬·ÎÁîº£ÅÍÁØºñ ½ºÅ³ µÎ°³ °°ÀÌ ¾È³ª°¡´Â ¹ö±×¼öÁ¤, ¼ÒÄÏ¼öÁ¤
// 219139 - 2005/12/07 3Â÷ Å¬·ÎÁîº£ÅÍÁØºñ OptionArchive ¼öÁ¤
// 219140 - 2005/12/07 3Â÷ Å¬·ÎÁîº£ÅÍÁØºñ »ç¿îµå¾ÆÄ«ÀÌºêº¯°æ, »óÅÂÈ®ÀÎ±â´É Ãß°¡
// 219141 - 2005/12/07 3Â÷ Å¬·ÎÁîº£ÅÍÁØºñ ÀÌ¸ðÆ¼ÄÜ À©µµ¿ì ¸øÃ£´Â ¹ö±× ¼öÁ¤
// 219142 - 2005/12/09 3Â÷ Å¬·ÎÁîº£Å¸Áß		Äü½½·Ô ¾÷µ¥ÀÌÆ® °»½Å 1ÃÊ·Î ¼¼ÆÃ, ·ÎµùÈÄ CoordPhysics¿¡¼­ ¸Ê±×·ìÀÌ NULL ºÎºÐ ¿À·ù ¼öÁ¤.
// 219143 - 2005/12/10 3Â÷ Å¬·ÎÁîº£Å¸Áß		¼­ÀÖ´Â »óÅÂ°¡ ¾Æ´Ò½Ã Ã¤³ÎÀÌµ¿½Ã Å¬¶óÀÌ¾ðÆ® Á×´Â ¹ö±× ¼öÁ¤
// 219144 - 2005/12/11 3Â÷ Å¬·ÎÁîº£Å¸Áß		°í½ºÆ®ÀÌ¹ÌÁö°¡ ÀÖ´Â Ã¤³Î·Î ÀÌµ¿½Ã °æ°íÃ¢°ú Á¾·á±â´É Ãß°¡

// 219145 - 2005/12/27 4Â÷ Å¬·ÎÁîº£Å¸ÁØºñ 1Â÷ÆÐÅ· AJJIYA
// 219146 - 2005/12/27 4Â÷ Å¬·ÎÁîº£Å¸ÁØºñ 2Â÷ÆÐÅ· IME¹æ½Ä ´ëÆøº¯°æ,Ãª È÷½ºÅä¸® ±â´É, À©µµ¿ìÇÁ·¹ÀÓ»çÀÌÁî, Æ÷Áö¼Çº¯°æ
// 219147 - 2005/12/28 4Â÷ Å¬·ÎÁîº£Å¸ÁØºñ ÀÎÅÍÆäÀÌ½º¸Þ´ÏÁ® ¾ÈÁ¤È­, Äù½ºÆ® ¹ö±×¼ö, IME¹æ½Ä»ìÂ¦º¯°æ
// 219148 - 2005/12/28 4Â÷ Å¬·ÎÁîº£Å¸ÁØºñ Edit À©µµ¿ì¹ö±× ¼öÁ¤, IME ¹ö±×¼öÁ¤, ·Îºñ ¼öÁ¤, Äù½ºÆ® ¼öÁ¤
// 219149 - 2005/12/28 4Â÷ Å¬·ÎÁîº£Å¸ÁØºñ IME ¹ö±×¼öÁ¤, ·Îºñ ¼öÁ¤
// 219150 - 2005/12/28 4Â÷ Å¬·ÎÁîº£Å¸ÁØºñ Ãª È÷½ºÅä¸® ¹ö±× ¼öÁ¤
// 219151 - 2005/12/28 4Â÷ Å¬·ÎÁîº£Å¸ÁØºñ Å°¸·Èû ¹ö±× ¼öÁ¤
// 219152 - 2005/12/28 4Â÷ Å¬·ÎÁîº£Å¸ÁØºñ Äü½½·Ô¹ö±× ¼öÁ¤
// 219153 - 2005/12/28 4Â÷ Å¬·ÎÁîº£Å¸ÁØºñ Ã¤³Î¿­¸°»óÅÂ¿¡¼­ ³ª°¡¸é Æ¨±â´Â ¹ö±× ¼öÁ¤
// 219154 - 2005/12/28 4Â÷ Å¬·ÎÁîº£Å¸ÁØºñ Ã¢°íÀÌ¹ÌÁö °¡·ÁÁö´Â°Å, ³×Æ®¿öÅ© Â÷´Ü ¿©·¯¹ø ³ª´Â°Å ÇÑ¹øÀ¸·Î ¼öÁ¤
// 219155 - 2005/12/28 4Â÷ Å¬·ÎÁîº£Å¸ÁØºñ Å¬¶óÀÌ¾ðÆ® ·¢ Æ©´×
// 219156 - 2005/12/28 4Â÷ Å¬·ÎÁîº£Å¸ÁØºñ Å¬¶óÀÌ¾ðÆ® ·¢ Æ©´× ¹ö±×¼öÁ¤
// 219157 - 2005/12/28 4Â÷ Å¬·ÎÁîº£Å¸ÁØºñ ¹åÁÙ¿öÇÁ ,¾×¼Ç ¹«½ÃµÇ´Â ¹ö±× ¼öÁ¤

// 220158 - 2006/01/12 ¼¢´Ù½Ã¿¬
// 220159 - 2006/01/12 ¼¢´Ù½Ã¿¬ ¸®¼Ò½ºº¯°æ¿¡ µû¸¥ ³ÎÃ¼Å© 

// 221160 - 2006/01/19 5Â÷ Å¬º£ Å×½ºÆ® 1Â÷
// 222161 - 2006/01/19 5Â÷ Å¬º£ Å×½ºÆ® »ç³» Å×½ºÆ® 1Â÷
// 222162 - 2006/01/19 5Â÷ Å¬º£ Å×½ºÆ® »ç³» Å×½ºÆ® 2. ÇÃ·¹ÀÌ¾î ¸ØÃß´Â¹ö±× ¼öÁ¤
// 222163 - 2006/01/19 5Â÷ Å¬º£ Å×½ºÆ® »ç³» Å×½ºÆ® 3 Ã¤³ÎÀÌµ¿½Ã ²÷±â´Â ¹ö±× ¼öÁ¤
// 222164 - 2006/01/19 5Â÷ Å¬º£ Å×½ºÆ® »ç³» Å×½ºÆ® 4 À¯´ÏÄÚµå ¹ö±×¼öÁ¤ ÇïÇÁ Ãß°¡
// 222165 - 2006/01/19 5Â÷ Å¬º£ Å×½ºÆ® »ç³» Å×½ºÆ® 5 Å×½ºÆ® ÄÚµå»èÁ¦
// 223166 - 2006/01/19 5Â÷ Å¬º£ Å×½ºÆ® »ç³» Å×½ºÆ® ¿îµ¿¼º ÆÐÅ¶ º¯°æ - ³Ë¹éµî
// 223167 - 2006/01/19 5Â÷ Å¬º£ Å×½ºÆ® »ç³» Å×½ºÆ® ±Ó¼Ó¸» Ãª¹ö±×, Äù½ºÆ® ´À³¦Ç¥ ¹ö±× ¼öÁ¤
// 223168 - 2006/01/19 5Â÷ Å¬º£ Å×½ºÆ® »ç³» Å×½ºÆ® ·ÎµùÂÊ ¼öÁ¤
// 223169 - 2006/01/19 5Â÷ Å¬º£ Å×½ºÆ® »ç³» Å×½ºÆ® Ãª È÷½ºÅä¸® Áö¿î°Å °ü·Ã, LDT ½Ç½Ã°£ ·Îµù °ü·Ã
// 223170 - 2006/01/19 5Â÷ Å¬º£ Å×½ºÆ® »ç³» Å×½ºÆ® NPC Äù½ºÆ® ·Î´õ AV À¯¹ß¼öÁ¤

// 224171 - 2006/01/19 5Â÷ Å¬º£ Å×½ºÆ® Final Test Å×½ºÆ®
// 224172 - 2006/01/19 5Â÷ Å¬º£ Å×½ºÆ® Final Test Å×½ºÆ®
// 224173 - 2006/01/19 5Â÷ Å¬º£ Å×½ºÆ® Final Test Å×½ºÆ®
// 225174 - 2006/01/19 5Â÷ Å¬º£ Å×½ºÆ® Final Test Å×½ºÆ®
// 225175 - 2006/01/19 5Â÷ Å¬º£ Å×½ºÆ® Final Test Å×½ºÆ® ¼ö·ÃÀå¿¡¼­ ¸÷¾Èº¸ÀÌ´Â ¹ö±× ¼öÁ¤
// 225176 - 2006/01/19 5Â÷ Å¬º£ Å×½ºÆ® Final Test Å×½ºÆ® ÀÌ¸§·»´õ °¡²û ¾ÈµÇ´Â ¹ö±× ¼öÁ¤
// 226177 - 2006/02/14 5Â÷ Å¬º£ Å×½ºÆ® Final Test Å×½ºÆ® Å°´­¸² ÀÚµ¿ÇØÁ¦, »ç¿îµåÂÊ ¼öÁ¤(¿¹Ãø) 

// 227178 - 2006/2/20 ¿ÀÇÂ¿¹Àü
// 227179 - 2006/2/21 ¿ÀÇÂ¿¹Àü
// 227180 - 2006/2/21 ¿ÀÇÂ¿¹Àü
// 227181 - 2006/2/21 ¿ÀÇÂ¿¹Àü <- Æ¯¼ö¹®ÀÚ·Î Ä³¸¯ÅÍ »ý¼º°¡´ÉÇÑ°Å ¸·À½
// 227182 - 2006/2/21 ¿ÀÇÂ¿¹Àü <- Æ¯¼ö¹®ÀÚ·Î Ä³¸¯ÅÍ »ý¼º°¡´ÉÇÑ°Å ¸·À½

// 228183 - 2006/2/28 ¿ÀÇÂ nProtectÇØÁ¦(ÀÎÅ©¸³¼Ç, ÇÁ·Î¼¼½ºÇÏÀÌµå), ÄÁÅÙÃ÷ º¯°æ 
// 228184 - 2006/3/7  ¿ÀÇÂ 
//				- ¿£ÁøºÎ ÆùÆ®ºÎºÐ ´Ù¿î¿¹»óºÎºÐ ¼öÁ¤ 
//				- »ç¿îµåºÎºÐ ´Ù¿î¿¹»ó¹× »ç¿îµå ¹ÌÃâ·Â¿¹»óºÎºÐ ¼öÁ¤
//				- Ã¼ÆÃ½Ã ±ÛÀÚ Â©·Á¼­ Àç´ë·Î Ç¥Çö¾ÈµÇ´Â ¹®Á¦ ¼öÁ¤
//				- ¾ÆÀÌÅÛ µå¶ø½Ã ¸ÊÀÇ ¹ØÀ¸·Î ºüÁö´Â Çö»ó ¼öÁ¤
//				- Å¸Ä³¸¯ÅÍ ÆÐ¼Ç ¾ÆÀÌÅÛ ¹× Àåºñ ¾ÆÀÌÅÛ Âø¿ë/ÇØÁ¦½Ã Àç´ë·Î ¾Èº¸ÀÌ´Â ¹ö±× ¼öÁ¤
//				- Æ®·¹ÀÌµå ¿äÃ»½Ã ¼­¹ö¿¡ ¸¹Àº ÆÖÅ¶À» º¸³¾¼ö ÀÖ¾ú´ø ¹®Á¦Á¡ ¼öÁ¤

// 228185 - 2006/3/14  ¿ÀÇÂ 
// 229185 - 2006/3/14  ¿ÀÇÂ 
// 229186 - 2006/3/14  ¿ÀÇÂ 
// 229187 - 2006/3/16  ÇïÇÁÃ¢ ¹ö±× ¼öÁ¤  
// 229188 - 2006/3/16  ÇïÇÁÃ¢ ¹ö±× ¼öÁ¤  
// 229189 - 2006/3/20  DMP °ü·Ã ¿øÀÎ ¹ö±× ¼öÁ¤ ( »ç¿îµå , ÆùÆ® , flush )
// 230190 - 2006/3/22  SPCoordPhysics ¼öÁ¤ ¹ö±×¼öÁ¤

// 230191 - //  [3/24/2006] BeginRender ½ÇÆÐ½Ã ·»´õ ¾ÈÇÔ, ·çÆÃ½ÇÆÐ½Ã Å©·¡½¬ Á¦°Å
// 230192 - //  [3/28/2006] ±Ó¸»ÇÒ¶§ '¤¡' Ãâ·ÂµÇ´Â ¹ö±× ¼öÁ¤

// 230193 - //  [3/31/2006]  ÃªÃ¢¿¡¼­ ³Î·Î Á×´Â ¹®Á¦¼öÁ¤

// 231194 - //  [4/21/2006]  Ä³½¬¼¥, ¿ìÃ¼Åë
// 232195 - //  [5/2/2006]   Ä³½¬¼¥, ¿ìÃ¼Åë ¸±¸®Áî Àü (Ä³½¬¼¥ ¸·À½)
// 232196 - //  [5/3/2006]   Ä³½¬¼¥, ¿ìÃ¼Åë ¸±¸®Áî Àü (Ä³½¬¼¥ ¸·À½)
// 233196 - //  [5/3/2006]   µµ¿ò´Ý±â ¹ö±× ¼öÁ¤
// 234196 - //  [5/4/2006]	 ¿ìÃ¼Åë °Å¸®Ã¼Å©¹×  ÆíÁö Ç®¸Þ½ÃÁö Ç¥½Ã Ãß°¡.	
// 234197 - //  [5/4/2006]	 ¿ìÃ¼Åë °Å¸®Ã¼Å©¹×  ÆíÁö Ç®¸Þ½ÃÁö Ç¥½Ã Ãß°¡.	
// 235198 - //  [5/9/2006]  ¿ìÃ¼Åë º¹»ç ¹ö±×¼öÁ¤.
// 235199 - //  [5/9/2006]  ¼±¹°¸¹ÀÌ µé¾î¿Ã¶§ ¹«ÇÑ·ÎÇÁ µµ´Â ¹ö±× ¼öÁ¤
// 236200 - //  [7/3/2006] ¸®´º¾ó »ç³»º£Å¸
// 237201 - //  [7/5/2006] ¸®´º¾ó ÆÐÄ¡ (¼­¹ö/Å¬¶óÀÌ¾ðÆ®)
// 238202 - //  [7/5/2006] ¾ÏÈ£È­ ÇÕÃÄ¼­ ¿Ã¶ó°¨ ¸®´º¾óÆÐÄ¡
// 238203 - //  [7/5/2006] ÀÎÅÍÆäÀÌ½ºº¯°æ ¹× ±âÅ¸ ¹ö±× ¼öÁ¤
// 238204 - //  [7/11/2006] ¸®´º¾ó »ç³»Å×½ºÆ® ÆÐÄ¡
// 238205 - //  [7/11/2006] ½ºÅ³ ¹ö±× ¼öÁ¤ ¹× ÇÁ·Ñ·Î±× ¹ö±× ¼öÁ¤
// 238206 - //  [7/12/2006]  ¹ö±× ¼öÁ¤
// 238207 - //  [7/13/2006]  Äü½½·Ô ¹ö±× ¼öÁ¤
// 238207 - //  [7/14/2006]  À¥ ·Î±×ÀÎ ¾ÆÀÌµð Áßº¹ Ã¼Å©½Ã ¾ÆÀÌµð/ºñ¹Ð¹øÈ£ Ã¢ Ç¥½Ã ¾ÈµÇ´Â ¹ö±× ¼öÁ¤
// 239209 - //  [7/14/2006]  Á¤½ÄÀü Å×½ºÆ®ÆÑ
// 240210 - //  [7/20/2006]    Á¤½ÄÀü 
// 240211 - //  [7/21/2006]    Á¤½ÄÀÌÈÄ ¹ö±×ÆÐÄ¡
// 241211 - //  [7/21/2006] Äü½½·Ô¹ö±×¼öÁ¤, ÅøÆÁ ±ô¹Ú°Å¸®´Â ¹ö±×¼öÁ¤, ÄÚ¾îµåÇÇÁ÷½º ¹ö±×¼öÁ¤, ÅøÆÁ ÀÌÆåÆ® Ãß°¡
// 241212 - //  [7/22/2006] Äù½ºÆ® ¹ö±× ¼öÁ¤ ( Äù½ºÆ® Å¬¸¯½Ã ¹öÆ° ¾È³ª¿À´Â ¹®Á¦ )
// 241213 - //  [7/24/2006] °³ÀÎ»óÁ¡¿¡¼­ Æ÷Å» »ç¿ë±ÝÁö, ½ºÅ³Ã¢¿¡¼­ ÅøÆÁ ¹öÇÁ·¹º§ ½Ç½Ã°£ ¾÷µ¥ÀÌÆ®
// 241214 - //  [7/26/2006] ¸®¼Ò½º RESID 0 ÇÊÅÍ¸µ °³ÀÎ»óÁ¡ ±¸¸ÅÃ¢ ³²ÀÌ ´ÝÀ»¼ö ¾ø°Ô ¼öÁ¤
// 241215 - //  [7/26/2006] ¸®¼Ò½ºÀÌ¸§ ³ÎÃ¼Å©, ¿¹Ãøµð¹ö±ë
// 242216 - //  [7/28/2006] ¹ö±×¼öÁ¤ ¾÷µ¥ÀÌÆ®
// 242217 - //  [8/2/2006]
// 243218 - //  [8/8/2006] Âò ¹ö±× ¼öÁ¤, ÆÐÅ¶º¯°æ
// 243219 - //  [8/10/2006] ·¹Áö½ºÆ®¸®º¯°æ, ¹öÀüÁ¤º¸º¯°æ, ÁÖÆÄ¼öÇÏÇâÁ¶Á¤
// 244219 - //  [8/23/2006] flush¼öÁ¤
// 244220 - //  [9/11/2006] »ç³»Å×½ºÆ®
// 244221 - //  [9/14/2006] »ç³»Å×½ºÆ® ¿þÀÌÆ÷ÀÎÆ® Å×½ºÆ®
// 244222 - //  [9/14/2006] »ç³»Å×½ºÆ® ³»¿ë ¸ð¸§ ¤Ð.¤Ð
// 244223 - //  [9/18/2006] »ç³»Å×½ºÆ® 
// 244224 - //  [9/19/2006] »ç³»Å×½ºÆ® 
// 244225 - //  [9/20/2006] »ç³»Å×½ºÆ® 
// 244226 - //  [9/20/2006] »ç³»Å×½ºÆ® 
// 244227 - //  [9/21/2006] IME ¹ö±×ÇÈ½º
// 244228 - //  [9/21/2006] ÃªÈ÷½ºÅä¸®, ÅÇ½ºÅ¾ ¹ö±×ÇÈ½º
// 244229 - //  [9/27/2006] IME ¹ö±×ÇÈ½º
// 244230 - //  [9/27/2006] ÀÎº¥¿¡¼­ ¾ÆÀÌÅÛ ³ª´­¶§ ¼¿·ºÆ® Á¦°Å
// 244231 - //  [10/16/2006] ¿ùµå¸Ê Ãà±¸Àå¿¡¼­ Å¬¶óÀÌ¾ðÆ® ºñÁ¤»óÀ¸·Î Á¾·á µÇ´Â ºÎºÐ ¹ö±× ¼öÁ¤
// 244232 - //  [11/2/2006] »ç³»Å×½ºÆ®
// 244233 - //  [11/3/2006] »ç³»Å×½ºÆ®
// 244234 - //  [11/3/2006] »ç³»Å×½ºÆ®
// 244235 - //  [11/7/2006] »ç³»Å×½ºÆ®
// 244236 - //  [11/7/2006] 11/8¸±¸®Áî
// 245237 - //  [11/8/2006] 11/8¸±¸®Áî
// 245238 - //  [11/8/2006] 11¿ù8ÀÏ¸±¸®Áî ¼±¹°¹ö±× ¼öÁ¤
// 245239 - //  [11/9/2006] ¹ö±×¼öÁ¤
// 245240 - //  [11/10/2006] ¹ö±×¼öÁ¤
// 245241 - //  [11/21/2006]
// 245242 - //  [11/24/2006] °í°´Áö¿øÆÀ¿¡¼­ Pet µ¿¿µ»ó Âû¿µÀ» À§ÇÑ Å×¼· ¾÷µ¥ÀÌÆ®
// 245243 - //  [11/24/2006] Pet ¾È³ª¿À´Â°Å ¼öÁ¤.
// 245244 - //  [12/01/2006] ÀÏº» ¹èÆ÷¿ë Å¬¶óÀÌ¾ðÆ®.
// 245245 - //  [12/01/2006] FX ¹ö±× ¼öÁ¤.
// 245246 - //  [12/02/2006] ¿þÀÌÆ÷ÀÎÆ® ±¹°¡º° ¼¼ÆÃ ¼³Á¤.
// 245247 - //  [12/06/2006] ÀÏº» ¹ö±× ¼öÁ¤¿ë ¹èÆ÷.
// 245248 - //  [12/12/2006] ÀÏº» ·Î±×ÀÎ È­¸é¿¡¼­ ½Å±Ô°¡ÀÔ , È¨ÆäÀÌÁö ¸µÅ© ·ÎÄÃºÎºÐ ¼öÁ¤.
// 246248 - //  [12/13/2006 metalgeni] ÀÏº» º£Å¸ ¸®ºôµå
// 246249 - //  [12/15/2006 metalgeni] È÷¶ó°¡³ª½Ã ¿µ¾î ÀÔ·ÂÇÒ¶§ Ãª ¹Ù·Î ³¯¶ó°¡´Â ¹®Á¦
// 246250 - //  [12/15/2006 metalgeni] °ø¹é Á¦´ë·Î Ã¼Å© ¾ÈµÇ´Â ¹®Á¦ 
// 246251 - //  [12/15/2006 metalgeni] °ø¹é Á¦´ë·Î Ã¼Å© ¾ÈµÇ´Â ¹®Á¦ 
// 246253 - //  [12/19/2006 metalgeni] »ç³»Å×½ºÆ® ÆÐÄ¡
// 246254 - //  [12/20/2006 metalgeni] »ç³»Å×½ºÆ® ÆÐÄ¡
// 246255 - //  [12/20/2006 metalgeni] »ç³»Å×½ºÆ® ÆÐÄ¡
// 247255 - //  [12/21/2006 metalgeni] ÀÏº» ¿ÀÇÂ ¹öÁ¯ 
// 247256 - //  [12/21/2006 metalgeni] ±âºÎÄù½ºÆ® °ü·Ã
// 247257 - //  [12/22/2006 metalgeni] ¾ÆÀÌÅÛ Åä±Û°ü·Ã ±â´É¼öÁ¤
// 247258 - //  [12/22/2006 metalgeni] ÆêÀÌ °­È­Ã¢¿¡ ¿Ã¶ó°¡´Â ¹ö±×
// 247259 - //  [12/22/2006 metalgeni] Æ¯¼ö¹®ÀÚ ¹ö±× ¼öÁ¤
// 247260 - //  [12/27/2006 metalgeni] Æ¯¼ö¹®ÀÚ ¹ö±× ¼öÁ¤
// 247261 - //  [1/3/2007 metalgeni] ·Î°í¼öÁ¤
// 247262 - //  [1/10/2007 metalgeni] ½ÌÅ© ¼öÁ¤
// 247263 - //  [1/16/2007 metalgeni] ÀÏº»ºôµå¹× ¿ì¸® ÆÐÄ¡
// 247264 - //  [1/23/2007 metalgeni] ·Î±ä·Îºñ ÀÎÅÍÆäÀÌ½º ¼öÁ¤
// 248264 - //  [1/25/2007 metalgeni] ÆÐÅ¶¼öÁ¤
// 248265 - //  [1/30/2007 metalgeni] ¹öµð ÆÑ
// 248266 - //  [1/30/2007 metalgeni] ¹öµð ÆÑ
// 248267 - //  [1/31/2007 metalgeni] ½Ã°£Á¦ ¸»·á ¸Þ½ÃÁö Ç¥½Ã
// 248268 - //  [1/31/2007 metalgeni] ¹öµð À¥·Î±× 512·Î º¯°æ
// 248269 - //  [2/5/2007 metalgeni]
// 248270 - //  [2/7/2007 metalgeni] Ä³½¬¼¥ µÇÆÈ±â ¸·Èù°Å Ç°
// 248271 - //  [2/7/2007 metalgeni] Ä³½¬¼¥¹ö±×¼öÁ¤ 
// 248272 - //  [2/8/2007 metalgeni] ÀÎÅÍÆäÀÌ½º ¸Å´ÏÁ® ³Î¹®Á¦·Î Á×´Â¹®Á¦ 
// 248273 - //  [2/8/2007 metalgeni] Á¾·á½Ã ¹öµð À¥¶ß´Â ¹ö±× ¼öÁ¤
// 248274 - //  [2/8/2007 AJJIYA] Áß±¹ ¹ö±× ¼öÁ¤.
// 248275 - //  [2/12/2007 metalgeni] Áß±¹ ¹ö±× ¼öÁ¤.
// 248276 - //  [2/13/2007 metalgeni] 2000¿¡¼­ alt+tab¹®Á¦
// 248277 - //  [2/13/2007 metalgeni] ·Î±ä ±æÀÌÃ¼Å©
// 248278 - //  [2/13/2007 metalgeni] ½ÃÀÛ½Ã ¹®Á¦Á¡ ¼öÁ¤
// 248279 - //  [2/15/2007 metalgeni] ÄÚ¾îµå ÇÇÁ÷½º ¼öÁ¤
// 248280 - //  [2/21/2007 metalgeni] ¼­¹ö ½ÌÅ© °ü·Ã ¼öÁ¤
// 248281 - //  [2/22/2007 metalgeni] ÀÏº» ¸±¸®Áî
// 249282 - //  [2/26/2007 metalgeni] ¼­¹ö Ä³¸¯ÅÍ ½ºÆ®·°ÃÄ º¯°æ
// 249283 - //  [2/27/2007 metalgeni] Å×½ºÆ® ¹öÁ¯
// 249284 - //  [2/28/2007 metalgeni] ÃªÇïÇÁ¿¡ µ·¿¡ , Âï±â
// 249285 - //  [2/28/2007 metalgeni] Ä³½¬¼¥ ±âÇÁÆ®¿¡ ³ÎÃ¼Å©
// 249286 - //  [3/2/2007 metalgeni] ÀÏº»ÆÖ ¸·´Â°Å
// 250287 - //  [3/7/2007 metalgeni] ¹öÁ¯ÅëÀÏ
// 250288 - //  [3/7/2007 metalgeni] ·Î±ä ·À½º Ã¼Å© »­
// 250289 - //  [3/14/2007 metalgeni] ¹öµð°ü·Ã ÀÎÁõÄÚµå º¯°æ
// 250290 - //  [3/15/2007 metalgeni] Áß±¹¸±¸®Áî
// 251290 - //  [3/15/2007 metalgeni]
// 251291 - //  [3/16/2007 metalgeni] ¸ÖÆ¼¾²·¹µå °ü·Ã ¶ô
// 251292 - //  [3/19/2007 metalgeni] ÀÏº» Ä³½¬¼¥ 10´ÜÀ§ Àý»è¹®Á¦, Àå¹Ù±¸´Ï ÆäÀÌÁö°ü·Ã ¾ø¾Ú
// 251293 - //  [3/21/2007 metalgeni] ÀÏº»¸±¸®Áî
// 251294 - //  [3/23/2007 metalgeni] ÀÏº» Ä³½¬¼¥ ÀÎÁõÅ°
// 251295 - //  [3/26/2007 metalgeni] ÀÏº» Äù½ºÆ®°ü·Ã
// 251297 - //  [3/27/2007 metalgeni] Æ®·¹ÀÌµå¿Ï·áÃ¢¾Èº¸ÀÌ´Â ¹ö±× ¼öÁ¤ (Å×¼·)
// 251298 - //  [3/27/2007 metalgeni] °Å·¡½Ã ¹öÆ° È°¼º
// 251300 - //  [3/30/2007 metalgeni] ÀÏº»Å×¼·
// 251301 - //  [4/3/2007 metalgeni] °Å·¡Ã¢ ¸®´º¾ó º»¼·
// 251302 - //  [4/4/2007 metalgeni] ÀÏº» ÀÎ°ÔÀÓÀ¥ Å×½ºÆ®¹öÁ¯
// 251305 - //  [4/11/2007 metalgeni] Á×´Â¹ö±×¼öÁ¤
// 251306 - //  [4/13/2007 AJJIYA] Æê ÀåÂø ÇØÁö½Ã ½ºÅ³ ¾÷µ¥ÀÌÆ® ¹ö±× ¼öÁ¤ , ÆíÁö ¿ìÇ¥ ±â´É Ãß°¡ ( ³»ºÎ Å×¼· Å×½ºÆ®¿ë )
// 252306 - //  [4/18/2007 metalgeni] ÀÎÁõÅ° °ü·Ã
// 252307 - //  [4/18/2007 metalgeni] Áß±¹ ¸®¼Ò½ºÈ­ÀÏ Ãß°¡ ÀÏº» IME¹× À¥ºê¶ó¿ìÁ®
// 252308 - //  [4/19/2007 metalgeni] ÀÏº» À¥ÆäÀÌÁö Å×½ºÆ® ÄÚµåÃß°¡¹× ½ÇÆÐ ¸Þ½ÃÁö Ãß°¡
// 252309 - //  [4/19/2007 metalgeni] ÀÏº» À¥ÆäÀÌÁö Å×½ºÆ® ÄÚµåÃß°¡¹× ½ÇÆÐ ¸Þ½ÃÁö Ãß°¡
// 252310 - //  [4/19/2007 metalgeni] ÀÏº» À¥ÆäÀÌÁö Å×½ºÆ® ÄÚµåÃß°¡¹× ½ÇÆÐ ¸Þ½ÃÁö Ãß°¡
// 252311 - //  [4/20/2007 metalgeni] ÀÏº» À¥ÆäÀÌÁö Å×½ºÆ® ÄÚµåÃß°¡¹× ½ÇÆÐ ¸Þ½ÃÁö Ãß°¡
// 252312 - //  [4/20/2007 metalgeni] ÀÏº» À¥ÆäÀÌÁö Å×½ºÆ® ÄÚµåÃß°¡¹× ½ÇÆÐ ¸Þ½ÃÁö Ãß°¡
// 252313 - //  [4/24/2007 AJJIYA] ±¹³» ÆÐÄ¡¸¦ À§ÇÑ ¾÷µ¥ÀÌÆ®
// 252314 - //  [4/25/2007 AJJIYA] ±¹³» ÆÐÄ¡¸¦ À§ÇÑ ¾÷µ¥ÀÌÆ® ( º¸½º¸÷ ·»´õÂÊ ¼öÁ¤ )
// 252315 - //  [4/25/2007 AJJIYA] ÀÏº» ÆÐÄ¡¸¦ À§ÇÑ ¾÷µ¥ÀÌÆ®
// 252316 - //  [4/25/2007 AJJIYA] ÀÏº» ÆÐÄ¡¸¦ À§ÇÑ ¾÷µ¥ÀÌÆ®
// 252317 - //  [4/26/2007 AJJIYA] ÀÏº» ÆÐÄ¡¸¦ À§ÇÑ ¾÷µ¥ÀÌÆ®
// 253317 - //  [4/30/2007 metalgeni] Áß±¹ÂÊ ¸®¼Ò½ºÈ­ÀÏ¸®½ºÆ® °Ù¼ö Ãß°¡¹× Ã¤ÆÃ ÃÖ½Å ¹öÁ¯ Àû¿ë
// 253318 - //  [5/2/2007 metalgeni] Å×½ºÆ®¼·
// 253319 - //	[5/4/2007 AJJIYA] ±æµå , Ã¤ÆÃ ¹ö±×¼öÁ¤ Å×½ºÆ® ¼­¹ö µ¿±âÈ­

// 252320* - //  [5/7/2007 metalgeni] ÀÏº»¹öÁ¯ ºÐ±â °ø°³¾ÈµÈ ¿þÀÌÆ÷ÀÎÆ® ¾Èº¸ÀÌ±â °ü·Ã ¾÷µ¥ÀÌÆ®
// 252321* - //  [5/15/2007 metalgeni] ÀÏº»¹öÁ¯ ºÐ±â »óÁ¡¿­°í Ã¤³ÎÀÌµ¿½Ã ¾È¿òÁ÷ÀÌ´Â ¹ö±× ¼öÁ¤

// 253322 - //  [5/15/2007 metalgeni] Ä£±¸ ½Ö¹æÇâ, ¾Ë¸²ÀÌ, Ä³½¬¼¥ ¸±·Îµå »ç³» Å×½ºÆ®
// 254323 - //  [5/21/2007 metalgeni] Áß±¹ ¸±¸®Áî
// 254324 - //  [5/23/2007 metalgeni] ÀÏº» ¸±¸®Áî
// 254325 -	//  [5/24/2007 AJJIYA]		Áß±¹ Ping °ü·Ã ÆÐÄ¡ ( ±âÁ¸ ½º·¹µå´Â Render¿´À¸³ª ÇöÀç Init¸¦ ½º·¹µå¸¦ µ¹·Á¼­ Ping ÃÊ±âÈ­ ºÎºÐ¿¡¼­ ¹®Á¦ ¹ß»ýµÊ )
// 254326 - //  [5/31/2007 metalgeni] Áß±¹ ¼­¹ö ¿ÜÄ¡±â ¹ö±× ¼öÁ¤ ¸±¸®Áî
// 254327 - //  [6/1/2007 metalgeni] ÃÊ±âÈ­¸é¹®Á¦ ¿¹Ãø µð¹ö±ë
// 254328 - //  [6/4/2007 metalgeni] Ä£±¸ ÃÊ´ë Çã¿ë, ½ºÅ©¸°¼¦ ¼ø¼­ ¹Ù²ñ
// 254330 - //  [6/5/2007 metalgeni] À¥·Î±ä ¹ö±×¼öÁ¤
// 254331 - //  [6/7/2007 metalgeni] È¸»öÈ­¸é ¿¹Ãø µð¹ö±ë
// 254332 - //  [6/8/2007 metalgeni] ÀÏº» ¾ÆÀÌµð ´ë¹®ÀÚ º¯È¯ ¹®Á¦¼öÁ¤
// 254333 - //  [6/11/2007 metalgeni] »Ì±â »ç³»Å×½ºÆ®
// 254334 - //  [6/15/2007 metalgeni] Æê ¸®ÇÁ·¹½Ã ¾ÈµÇ´Â ¹®Á¦ ¼öÁ¤
// 254335 - //  [6/18/2007 metalgeni] ÀÏº» ¿É¼Ç º¯°æ(Ä£±¸°ü·Ã ¼­¹ö¾÷µ¥ÀÌÆ®°¡ ¾ÈµÇÀÖÀ½)
// 254336 - //  [6/19/2007 metalgeni] »Ì±â°ü·Ã ÆäÀÌÁö ¹ö±×¼öÁ¤ , À¥·Î±×ÀÎ ¾ÆÀÌµð ±æÀÌ º¯°æ 24¹ÙÀÌÆ® , ¹öµð À¥·Î±×ÀÎ½Ã ¼­¹ö Á¢¼Ó ½ÇÆÐ ( Å¸ÀÓ ) ½Ã ·Î±×ÀÎ ¹Ú½º ³ª¿À´Â ¹®Á¦ ¼öÁ¤.
// 254337 - //  [6/21/2007 metalgeni] ¾ÆÀÌÅÛ ¹ö¸±¶§ NPCÄÆÀÎ µé¾î°¡´Â ¹ö±× ¼öÁ¤
// 255337 - //  [6/27/2007 metalgeni] ÇÇ·Îµµ ½Ã½ºÅÛ Ãß°¡
// 255338 - //  [7/9/2007 metalgeni] ÀÏº»¾î ¹Ý°¢ ¹ö±× ¸±¸®Áî.
// 255339 - //  [7/10/2007 metalgeni] ÀÏº» Á¶ÀÌ½ºÆ½ ³ª¿À´Â°Å ¸·°í ´Ù½Ã ¸±¸®Áî.
// 255340 - //  [7/11/2007 metalgeni] Ä³½¬¼¥ÆÐÅ°Áö¾ÆÀÌÅÛ ½ºÅÃ(°¹¼ö) Ç¥½Ã Ãß°¡
// 255341 - //  [7/12/2007 metalgeni] ÇÇ·Îµµ¾÷µ¥ÀÌÆ®, IDC¼±ÅÃ°ü·Ã Áß±¹ ¸±¸®Áî
// 255342 - //  [7/13/2007 metalgeni] ÇÇ·Îµµ¾÷µ¥ÀÌÆ®
// 255243 - //  [7/13/2007 metalgeni] Ä£±¸Ãß°¡ ¿äÃ» ¹ö±×¼öÁ¤(Áß±¹)
// 256343 - //  [7/18/2007 metalgeni] ¸®¼Ò½ºÃ¼Å© Ãß°¡ 
// 256344 - //  [7/19/2007 metalgeni] ÀÏº»¾îÅ°º¸µå ¸ÊÇÎ°ü·Ã
// 257344 - //  [7/23/2007 metalgeni] ¸»Ç³¼± ºê·ÎµåÄ³½ºÆ®¹ö±× °ü·Ã
// 257345 - //  [7/27/2007 metalgeni] ÀÏº» ÅøÆÁ ¹ö±×¼öÁ¤
// 257346 - //  [7/30/2007 metalgeni] Áß±¹ ±æµå °ü·Ã ¹ö±× ¼öÁ¤
// 257347 - //  [7/31/2007 metalgeni] ÀÏº» ÆÐµå°ü·Ã¼öÁ¤
// 257348 - //  [7/31/2007 metalgeni] À©µµ¿ì È­¸é¿¡¼­ Áß±¹ ÇØ»óµµ º¹±¸ ¾ÈµÇ´Â ¹®Á¦ ÇØ°á
// 257349 - //  [8/2/2007 metalgeni] ¸®¼Ò½º ¹öÁ¯Ã¼Å© ÀÎµ¦½º ºñ¾ùÀ»¶§ ¹®Á¦ ¼öÁ¤
// 257350 - //  [8/3/2007 metalgeni] ±æµå ³ëÆ¼½º°ü·Ã ¼öÁ¤ 
// 257351 - //  [8/6/2007 metalgeni] ¶óµ¦ ÇÏÀÌµå±â´ÉÃß°¡ 
// 257352 - //  [8/7/2007 metalgeni] Áß±¹ µÇÆÈ±â °ü·Ã ¼öÁ¤
// 257353 - //  [8/7/2007 metalgeni] Áß±¹ ±æµåÀå À§ÀÓ ¸®¼Ò½º°ü·Ã ¹®Á¦ ·Ñ¹é
// 257354 - //  [8/7/2007 metalgeni] ±æµå¿øÁ¤º¸Ã¢¿¡¼­ Å¬¸¯ÀÌ ¾ÈµÇ´Â ¹ö±× ¼öÁ¤
// 257355 - //  [8/8/2007 metalgeni] ¾÷±×·¹ÀÌµå Á¶°Ç Ãß°¡
// 257356 - //  [8/8/2007 metalgeni] À¥ºê¶ó¿ìÁ® ÀÏº» IE6.0ÀÏ¶§ ÇÏ¾áÈ­¸é ¹ö±× ¼öÁ¤
// 257357 - //  [8/20/2007 metalgeni] ÀÏº» ±æµå ÃÊ´ë ¹ö±×, ÀÎ¾×Æ¼ºê½Ã ÇØ»óµµ º¹±¸ ¾ÈµÇ´Â ¹ö±× ¼öÁ¤
// 257358 - //  [8/22/2007 metalgeni] ÀÏº» ¸±¸®Áî»óÀÇ ¿À·ù¼öÁ¤
// 258358 - //  [8/24/2007 metalgeni] ÄÞº¸Ãß°¡ Áß±¹¸±¸®Áî
// 257359 - //  [8/31/2007 metalgeni] Áß±¹ ÆÐÄ¡ ÇÁ·Î¼¼½º º¯°æ¹®Á¦·Î ºê·»Ä¡(IDC ¼±ÅÃ ºüÁü)
// 258360 - //  [9/3/2007 metalgeni] »ç³»Å×½ºÆ® ¸ÖÆ¼Æ÷Å», Item¹Ù²Ù±â, Ã¤ÆÃ¸ÅÅ©·Î, ÄÞº¸..
// 258361 - //  [9/5/2007 metalgeni] ÇÇ·Îµµ ¼öÁ¤
// 258362 - //  [9/7/2007 metalgeni] Áß±¹ ¸®¼Ò½ºÈ­ÀÏ Ãß°¡
// 258363 - //  [9/14/2007 AJJIYA] ÀÏº» ¹Ì´Ï¸Ê¿¡ ¸ÞÀÏ¹Ú½º ¾ÆÀÌÄÜ Ãß°¡, Ä³½Ã¼¥¿¡¼­ SPWindowStaic ¿À·ù »çÇ×¼öÁ¤.
// 258364 - //  [9/19/2007 AJJIYA] ¹öµð¹öµð ·Î±×ÀÎ ¼º°øÈÄ ¿¡·¯ ¹ß»ý½Ã ·Î±×ÀÎÃ¢ º¸¿©ÁöÁö ¾Ê°Ô ¼öÁ¤, ÀÎ´ø¿¡¼­ À¯Àú°£ °Å·¡½Ã Ãë¼Ò½Ã ÆÐ¼Ç¼¥ ¿ÀÇÂµÇ´Â ºÎºÐ ¼öÁ¤.
// 258365 - //  [9/19/2007 AJJIYA] ½ºÅ×ÀÌÁö º¯°æ½Ã Ä£±¸ ¾Ë¸®¹Ì°¡ °è¼Ó ¹ß»ýµÇ´Â ºÎºÐ ¼öÁ¤. ( Ã¹ Ã¤³Î ·Î±×ÀÎ °ü·ÃµÈ ±â´É )
// 258366 - //  [9/21/2007 AJJIYA] Áß±¹ ÆÐÄ¡¿ë ¹öÀü ( ÀÎ´ø¿¡¼­ °Å·¡ Ãë¼Ò½Ã ÆÐ¼Ç¼¥ ¿­¸®´Â ¹®Á¦ , ½ºÅ×ÀÌÁö ÀÌµ¿½Ã Ä£±¸ Á¢¼Ó ¾Ë¸² ºÎºÐ ¹ö±× ¼öÁ¤¿ë )
// 258367 - //  [9/21/2007 AJJIYA] Áß±¹ ÆÐÄ¡¿ë ¹öÀü ( ±æµå¿ø Á¢¼Ó½Ã ½ºÆ®¸µ ºñ±³ ±â´É , ¼¼Æ® ¾ÆÀÌÅÛ ¹è°æ º¯°æ »çÇ× Àû¿ë )
// 258368 - //  [9/27/2007 metalgeni] SPWindowEditMultiLine ¼öÁ¤ Áß±¹ ¸±¸®Áî
// 258369 - //  [9/27/2007 metalgeni] SPWindowEditMultiLine ¸¶ÀÌÅ©°ü·Ã ±æÀÌ ¹ö±× ¼öÁ¤
	// 258 370 - //	  [11/1/2007 AJJIYA] Áß±¹ ¶óµ¦ ¹ö±× ¼öÁ¤. Áß°£ Á¡ÇÁ. 
// 258370 - //  [9/27/2007 metalgeni] ÀÏº» Á¶ÀÌ½ºÆ½ ¹ö±× ¼öÁ¤
// 258371 - //  [9/28/2007 metalgeni] ÀÏº» ¼öÁ¤¸±¸®Áî ¿À·ù·Î ´Ù½Ã ¸±¸®Áî
// 258372 - //  [10/1/2007 metalgeni] ÀÏº» Á¶ÀÌÆÐµå ¹«ÇÑ ÀÌº¥Æ® ÇØ°á
// 259372 - //  [10/2/2007 metalgeni] 10¿ùÆÐÄ¡ ÄÜÅÙÃ÷ ¾ÆÀÌÅÛ Á¶ÇÕ, Äù½ºÆ® °øÀ¯, ½ºÅ³ÃÊ±âÈ­ º¯°æ, ±æµåº¯°æ
// 259373 - //  [10/17/2007 metalgeni] Á¶ÇÕ ¶ô ¹ö±× ¼öÁ¤
// 259374 - //  [10/18/2007 metalgeni] Á¶ÇÕ ¸Þ½ÃÁö ¹ö±× ¼öÁ¤, °³ÀÎ»óÁ¡ ÄÆÀÎ ¹Ù²Ù´Â ¹ö±× ¼öÁ¤
// 259375 - //  [10/19/2007 metalgeni] °­Á¦ÀÌº¥Æ®½Ã ¾ÆÀÌÅÛ Ã¼Å© ÀÌº¥Æ® ¹ö±× ¼öÁ¤
// 259376 -	//  [2007/10/24]-jinhee NpcEvent ÇÊ¿ä ¾ÆÀÌÅÛ ½ºÅÃÇ¥Çö ¹ö±× ¼öÁ¤, NPCEvent ¿¡·¯ ¸Þ½ÃÁö Áßº¹ Ãâ·Â ¼öÁ¤, CutIn ÀüÈ¯½Ã Å¬¸¯ ¾ÈµÇ´Â Çö»ó ¼öÁ¤
// 259377 - //  [2007/10/24]-jinhee Guild °ü·Ã ¼öÁ¤
// 259378 - //  [10/31/2007 metalgeni] ¸ó½ºÅÍ HP °ÔÀÌÁö Àû¿ë, ¾ÆÀÌÅÛ Á¶ÇÕ ½ºÅ³ ÃÊ±âÈ­ ½Ã Äü½½·Ô¿¡ ¿Ã·ÁÁø ºÎºÐ Áö¿öÁö´Â °Å ,Ä³½Ã¼¥ ¸®½ºÆ® ¹ö±× ¼öÁ¤. ¸ÖÆ¼¾²·¹µå µð¹ÙÀÌ½º
// 259379 - //  [10/31/2007 metalgeni] ¸ó½ºÅÍ HP °ÔÀÌÁö Àû¿ë ÀÏ¹Ý ¸÷ HPÃß°¡
// 259380 - //  [11/2/2007 metalgeni] ÀÏº» ¾ÏÈ£È­ÇØ¼­ ´Ù½Ã ºôµå
// 259381 - //  [11/13/2007 metalgeni] ±æµå¼öÁ¤ (ÀÏº»)
// 259382 - //  [11/13/2007 metalgeni] À¥ºê¶ó¿ìÁ® Àß¸ø³ª°£°Å ´Ù½Ã ¸±¸®Áî
// 259383 - //  [11/13/2007 AJJIYA] ÀÏº» À¥ºê¶ó¿ìÀú¿ë ºôµå
// 259384 - //	[11/14/2007 AJJIYA] º»¼· ÆÐÄ¡¿ë( °×ºí ) ÃÖ½Å¹öÀü ºôµå
// 259385 - //  [11/19/2007 metalgeni] ±æµå º¯°æ
// 259386 - //  [11/20/2007 metalgeni] ÀÏº» ±æµå º¯°æ
// 259387 - //  [11/22/2007 metalgeni] ÀÏº» ÀÎ°×À¥ ÆÐÄ¡
// 259388 - //  [11/28/2007 AJJIYA] ·¹º§¾÷ÀÇ ÃÖ½Å ±â´ÉÀÌ Æ÷ÇÔµÊ. ÇöÀç ¹öÀüÀ¸·Î ¼öÁ¤. ÀÏº» ¿äÃ»
// 259389 - //  [12/7/2007 metalgeni] Ä³¸¯ÅÍ ³×ÀÓ ½¦µµ¿ì ¾ø¾îÁö´Â ¹®Á¦
// 260389 - //  [12/17/2007 metalgeni] 12¿ùÆÐÄ¡ ¸±¸®Áî¿ë
// 260390 - //  [12/19/2007 duragon] Ä³¸¯ÅÍ »ý¼º ¹× PVP LoadWait¼öÁ¤ (EXEÆÐÄ¡ ¹®Á¦·Î ¹öÀü¾÷)
// 260391 - //  [12/27/2007 metalgeni] Æê·¹º§¾÷ ·¹¾îµµ °íÄ§, Ã¤ÆÃ¸ÅÅ©·Î ¼öÁ¤
// 260392 - //  [1/9/2008 metalgeni] Áß±¹¾î IME»óÅÂ¿¡¼­ alt+tab´©¸¦¶§ cpuÁ¡À¯À² ¿Ã¶ó°¡´Â ¹®Á¦ÇØ°á (SPWindowChat::ParserChat ¸Þ¸ð¸® µ¥¹ÌÁö)
// 260393 - //  [1/10/2008 metalgeni] wraped SetRenderState crush - alt+tab½Ã Á×´Â´Ù´Â¹ö±× ¿¹Ãøµð¹ö±ë
// 260394 - //  [1/10/2008 metalgeni] wraped EndRender crush 	alt+tab½Ã Á×´Â´Ù´Â¹ö±× ¿¹Ãøµð¹ö±ë
// 260395 - //  [1/11/2008 AJJIYA] ÀÏº» PVP °ü·Ã UI Á¤¸® °Ç
// 260396 - //  [1/28/2008 metalgeni] ÀÏº» @Gamez ºô¸µ»çÀÌÆ® ¾È¶ß´Â ¹ö±× ¼öÁ¤¹× ÆÐ½º¿öµå Áö¿ì´Â°Å(Áß±¹) Ãß°¡
// 260397 - //  [2/1/2008 metalgeni] ÀÏº» @Gamez ºô¸µ»çÀÌÆ® URL°íÄ§, BeginRender ¼öÁ¤
// 260398 - //  [2/4/2008 metalgeni] °³ÀÎ»óÁ¡ ¸®·¿ ¹ö±×¼öÁ¤
// 260399 - //  [2/13/2008 metalgeni] Æ÷ÀÎÆ®¼¥ 
// 260400 - //  [2/20/2008 metalgeni] IngameWeb start/stop CallBack Ãß°¡¹× ÀÎÇ²µð¼¼ÀÌºí±â´ÉÃß°¡
// 260401 - //  [2/27/2008 metalgeni] ÆÐ¼Ç»ð ÇÁ¸®ºä¹ö±×¼öÁ¤, ¿ùµå¸ÊÀÇ Á÷¾÷¾ÆÀÌÄÜ ¾È³ª¿À´Â°Å ¼öÁ¤
// 260402 - //  [2/29/2008 metalgeni] ÇÁ¸®¸¶ÄÏ ½ºÅ©·Ñ, Æê(¾ÆÀÌÅÛ ÀÌÁßµî·Ï)µî ¹ö±×¼öÁ¤
// 260403 - //  [3/10/2008 metalgeni] NPCÀÌº¥Æ® ·¥´ý½Ã ÀÎº¥Åä¸® Ã¼Å©
// 260404 - //  [3/12/2008 metalgeni] Áß±¹ ¼¢´Ù IngameWeb º¯°æ
// 260405 - //  [3/12/2008 metalgeni] Æ÷ÀÎÆ®¼¥ Àû¿ë ¸±¸®Áî
// 260406 - //  [3/27/2008 metalgeni] ¸®Æ÷Æ®¼¦ ¸·°í, ±æµå Á×´Â ¹ö±× ¼öÁ¤
// 260407 - //  [4/3/2008 metalgeni] LRF¸±¸®Áî
// 260408 - //  [4/11/2008 metalgeni] Áß±¹ ÀÎ°ÔÀÓÀ¥
// 260409 - //  [5/8/2008 metalgeni] ¾ÆÀÌÅÛ ½Ã°£¿¬ÀåÃ¢¿¡¼­ ¶ôÀÌ ¾ÈÇ®¸®´Â ¹®Á¦ ¼öÁ¤
// 260410 - //  [6/17/2008 metalgeni] Ä³½¬¼¥¹ö±× IDÀÔ·Â¾øÀÌ Å¬¶óÀÌ¾ðÆ®¿¡¼­ ³Ñ±è
// 260411 - //  [6/18/2008 metalgeni] ÀÏº» Àç ¸±¸®Áî
// 261412 - //  [6/30/2008 metalgeni] 7¿ùÆÐÄ¡,  ¹Ì±¹
// 261413 - //  [7/2/2008 metalgeni] ¹Ì±¹ ¿µ¹® ÀÚµ¿ ÁÙ¹Ù²Þ
// 261414 - //  [7/3/2008 metalgeni] ¹Ì±¹ ¿µ¹® ÀÚµ¿ ÁÙ¹Ù²Þ ¹ö±×¼öÁ¤
// 261415 - //  [7/7/2008 metalgeni] ¹Ì±¹ ¿µ¹® IME¼ÂÆÃ ¹ö±×¼öÁ¤
// 261416 - //  [7/8/2008 metalgeni] SPWindowTypeWrter ÀÚµ¿ ÁÙ¹Ù²Þ
// 261417 - //  [7/10/2008 metalgeni] ÀÎ´ø¸®¼Â¿À·ù ¹ö±×¼öÁ¤, ÀÏº» ¸±¸®Áî
// 261418 - //  [7/10/2008 metalgeni] SPWindowTypeWrter ÀÚµ¿ ÁÙ¹Ù²Þ, »çÀÌÁî Å¬¸®ÇÎ ¹ö±×¼öÁ¤
// 261419 - //  [7/15/2008 metalgeni] SPGOBModelUnit°è¿­ RenderPos¹ö±× ¼öÁ¤
// 261420 - //  [7/17/2008 metalgeni] °æ¸Å³ª¿ÂÈÄ °³ÀÎ»óÁ¡ µð¼¼ÀÌºí ¾ÈÇ®¾îÁö´Â ¹ö±×, Æ÷ÀÎÆ® LocalozeLDTÀÐ°í ¾È³ª¿À°Ô ÇÏ´Â±â´ÉÃß°¡, ÀÌº¥Æ®NPC¸¦ÅëÇØ ¿Ï·á°»½Å¹ö±×¼öÁ¤
// 262420 - //  [7/22/2008 metalgeni] ½ºÅ³ÃÊ±âÈ­ ÆÐÅ¶Ãß°¡

//// test
//const char* RESOURCE_FILES2[] = {	
//	"TESTPACK.SPF",
//	"AJJIYA.SPF",	
//	"HOSHIM.SPF",
//	"ROWID.SPF",
//	"JINSSAGA.SPF",
//	"MAKO1298.SPF",
//	"METALGENI.SPF", //7
//
//	"DALBONG.SPF", // 2006/2/14 Ãß°¡
//	"RYUMS.SPF",
//	"BANX.SPF",
//	"BARY.SPF",
//	"ZENNE.SPF",
//	"CLAIRE.SPF",
//	"CVOICE.SPF", // ÀÌÇÏ ¼¼°³´Â ½ºÆä¾îÈ­ÀÏ¸í
//	"GUSTAV.SPF",	
//	"CRI.SPF",
//
//	"DURAGON.SPF", // 3Â÷ Ãß°¡ºÐ 2005/4/18
//	"TOMA.SPF",
//	"CLETS.SPF",
//	"BORORU.SPF",
//	"JOOX3.SPF",
//	"BONGSIK.SPF",
//	"RM.SPF",
//	"JJALRAJO.SPF",
//
//	"JJANG.SPF", //  [9/7/2007 metalgeni] 2007/9/7 Ãß°¡ºÐ(Áß±¹)
//	"FREE.SPF", 
//	"BAS.SPF",
//	"BUGLE.SPF",
//
//	"JMULRO.SPF",
//	 "CHIRS.SPF",
//	"LILY.SPF",
//	"FUYU.SPF",
//};

// test
const char* RESOURCE_FILES2[] = {	
	"TESTPACK.SPF",
	"-AJJIYA.SPF",	
	"HOSHIM.SPF",
	"ROWID.SPF",
	"-JINSSAGA.SPF",
	"MAKO1298.SPF",
	"METALGENI.SPF", //7

	"DALBONG.SPF", // 2006/2/14 Ãß°¡
	"RYUMS.SPF",
	"BANX.SPF",
	"BARY.SPF",
	"-ZENNE.SPF",
	"CLAIRE.SPF",
	"CVOICE.SPF", // ÀÌÇÏ ¼¼°³´Â ½ºÆä¾îÈ­ÀÏ¸í
	"GUSTAV.SPF",	
	"CRI.SPF",

	"DURAGON.SPF", // 3Â÷ Ãß°¡ºÐ 2005/4/18
	"-TOMA.SPF",
	"CLETS.SPF",
	"BORORU.SPF",
	"JOOX3.SPF",
	"BONGSIK.SPF",
	"RM.SPF",
	"JJALRAJO.SPF",

	"JJANG.SPF", //  [9/7/2007 metalgeni] 2007/9/7 Ãß°¡ºÐ(Áß±¹)
	"-FREE.SPF", 
	"-BAS.SPF",
	"BUGLE.SPF",

	"CHIRS.SPF",
	"LILY.SPF",
	"FUYU.SPF",
	"JMULRO.SPF",
	"CC.SPF",
	"CW.SPF",
	"JX.SPF",
	"PCZ.SPF",
	"BJF.SPF",
};


// ¹öÀü È®ÀÎ : Major ³Ñ¹ö¸¸À¸·Î È®ÀÎ ¹öÀü
bool VersionCheck(unsigned short uiMajor,unsigned short /*uiMinor*/,unsigned int /*uiOption*/)
{
	if(uiMajor >= VER_MAJOR)
		return true;

	// ÇÊ¿ä¿¡ µû¶ó Ãß°¡ °ËÁõ ÀýÂ÷ Ãß°¡

	// ...

	return false;
}

unsigned int GetLataleVersion()
{
	unsigned int uiVersion = VER_MAJOR;
	uiVersion <<= 16;
	uiVersion |= VER_MINOR;

	return uiVersion;
}

//}
